QuantumLeaps/3rd_party/nucleo-u545re/arm/startup_stm32u545retxq.s
;*****************************************************************************
; @file     startup_stm32u545retxq.s for ARM-KEIL ARM assembler
; @brief    CMSIS Cortex-M4F Core Device Startup File for stm32u545retx6
; @date     23 Jun 2024
;
; Modified by Quantum Leaps:
; - Added relocating of the Vector Table to free up the 256B region at 0x0
;   for NULL-pointer protection by the MPU.
; - Modified all exception handlers to branch to assert_failed()
;   instead of locking up the CPU inside an endless loop.
;
; @description
; Created from the CMSIS template for the specified device
; Quantum Leaps, www.state-machine.com
;
; @note
; The symbols Stack_Size and Heap_Size should be provided on the command-
; line options to the assembler, for example as:
;     --pd "Stack_Size SETA 1024" --pd "Heap_Size SETA 0"


;******************************************************************************
; Allocate space for the stack.
;
        AREA    STACK, NOINIT, READWRITE, ALIGN=3
__stack_base
StackMem
        SPACE   Stack_Size    ; provided in command-line option, for example:
                              ; --pd "Stack_Size SETA 512"
__stack_limit
__initial_sp

;******************************************************************************
; Allocate space for the heap.
;
        AREA    HEAP, NOINIT, READWRITE, ALIGN=3
__heap_base
HeapMem
        SPACE   Heap_Size     ; provided in command-line option, for example:
                              ; --pd "Heap_Size SETA 0"
__heap_limit

; Indicate that the code in this file preserves 8-byte alignment of the stack.
        PRESERVE8

;******************************************************************************
; The vector table.
;
; Place code into the reset code section.
        AREA   RESET, DATA, READONLY, ALIGN=8
        EXPORT  __Vectors
        EXPORT  __Vectors_End
        EXPORT  __Vectors_Size

__Vectors
        DCD     __initial_sp                ; Top of Stack
        DCD     Reset_Handler               ; Reset Handler
        DCD     NMI_Handler                 ; NMI Handler
        DCD     HardFault_Handler           ; Hard Fault Handler
        DCD     MemManage_Handler           ; Memory Manage (MPU) Handler
        DCD     BusFault_Handler            ; Bus Fault Handler
        DCD     UsageFault_Handler          ; Usage Fault Handler
        DCD     SecureFault_Handler         ; Secure Fault Handler
        DCD     Default_Handler             ; Reserved
        DCD     Default_Handler             ; Reserved
        DCD     Default_Handler             ; Reserved
        DCD     SVC_Handler                 ; SVCall handler
        DCD     DebugMon_Handler            ; Debug Monitor handler
        DCD     Default_Handler             ; Reserved
        DCD     PendSV_Handler              ; PendSV handler
        DCD     SysTick_Handler             ; SysTick handler

        ; IRQ handlers...
        DCD     WWDG_IRQHandler             ; [  0]
        DCD     PVD_PVM_IRQHandler          ; [  1]
        DCD     RTC_IRQHandler              ; [  2]
        DCD     RTC_S_IRQHandler            ; [  3]
        DCD     TAMP_IRQHandler             ; [  4]
        DCD     RAMCFG_IRQHandler           ; [  5]
        DCD     FLASH_IRQHandler            ; [  6]
        DCD     FLASH_S_IRQHandler          ; [  7]
        DCD     GTZC_IRQHandler             ; [  8]
        DCD     RCC_IRQHandler              ; [  9]
        DCD     RCC_S_IRQHandler            ; [ 10]
        DCD     EXTI0_IRQHandler            ; [ 11]
        DCD     EXTI1_IRQHandler            ; [ 12]
        DCD     EXTI2_IRQHandler            ; [ 13]
        DCD     EXTI3_IRQHandler            ; [ 14]
        DCD     EXTI4_IRQHandler            ; [ 15]
        DCD     EXTI5_IRQHandler            ; [ 16]
        DCD     EXTI6_IRQHandler            ; [ 17]
        DCD     EXTI7_IRQHandler            ; [ 18]
        DCD     EXTI8_IRQHandler            ; [ 19]
        DCD     EXTI9_IRQHandler            ; [ 20]
        DCD     EXTI10_IRQHandler           ; [ 21]
        DCD     EXTI11_IRQHandler           ; [ 22]
        DCD     EXTI12_IRQHandler           ; [ 23]
        DCD     EXTI13_IRQHandler           ; [ 24]
        DCD     EXTI14_IRQHandler           ; [ 25]
        DCD     EXTI15_IRQHandler           ; [ 26]
        DCD     IWDG_IRQHandler             ; [ 27]
        DCD     SAES_IRQHandler             ; [ 28]
        DCD     GPDMA1_Channel0_IRQHandler  ; [ 29]
        DCD     GPDMA1_Channel1_IRQHandler  ; [ 30]
        DCD     GPDMA1_Channel2_IRQHandler  ; [ 31]
        DCD     GPDMA1_Channel3_IRQHandler  ; [ 32]
        DCD     GPDMA1_Channel4_IRQHandler  ; [ 33]
        DCD     GPDMA1_Channel5_IRQHandler  ; [ 34]
        DCD     GPDMA1_Channel6_IRQHandler  ; [ 35]
        DCD     GPDMA1_Channel7_IRQHandler  ; [ 36]
        DCD     ADC1_IRQHandler             ; [ 37]
        DCD     DAC1_IRQHandler             ; [ 38]
        DCD     FDCAN1_IT0_IRQHandler       ; [ 39]
        DCD     FDCAN1_IT1_IRQHandler       ; [ 40]
        DCD     TIM1_BRK_IRQHandler         ; [ 41]
        DCD     TIM1_UP_IRQHandler          ; [ 42]
        DCD     TIM1_TRG_COM_IRQHandler     ; [ 43]
        DCD     TIM1_CC_IRQHandler          ; [ 44]
        DCD     TIM2_IRQHandler             ; [ 45]
        DCD     TIM3_IRQHandler             ; [ 46]
        DCD     TIM4_IRQHandler             ; [ 47]
        DCD     TIM5_IRQHandler             ; [ 48]
        DCD     TIM6_IRQHandler             ; [ 49]
        DCD     TIM7_IRQHandler             ; [ 50]
        DCD     TIM8_BRK_IRQHandler         ; [ 51]
        DCD     TIM8_UP_IRQHandler          ; [ 52]
        DCD     TIM8_TRG_COM_IRQHandler     ; [ 53]
        DCD     TIM8_CC_IRQHandler          ; [ 54]
        DCD     I2C1_EV_IRQHandler          ; [ 55]
        DCD     I2C1_ER_IRQHandler          ; [ 56]
        DCD     I2C2_EV_IRQHandler          ; [ 57]
        DCD     I2C2_ER_IRQHandler          ; [ 58]
        DCD     SPI1_IRQHandler             ; [ 59]
        DCD     SPI2_IRQHandler             ; [ 60]
        DCD     USART1_IRQHandler           ; [ 61]
        DCD     Reserved62_Handler          ; [ 62]
        DCD     USART3_IRQHandler           ; [ 63]
        DCD     UART4_IRQHandler            ; [ 64]
        DCD     UART5_IRQHandler            ; [ 65]
        DCD     LPUART1_IRQHandler          ; [ 66]
        DCD     LPTIM1_IRQHandler           ; [ 67]
        DCD     LPTIM2_IRQHandler           ; [ 68]
        DCD     TIM15_IRQHandler            ; [ 69]
        DCD     TIM16_IRQHandler            ; [ 70]
        DCD     TIM17_IRQHandler            ; [ 71]
        DCD     COMP_IRQHandler             ; [ 72]
        DCD     USB_IRQHandler              ; [ 73]
        DCD     CRS_IRQHandler              ; [ 74]
        DCD     Reserved75_Handler          ; [ 75]
        DCD     OCTOSPI1_IRQHandler         ; [ 76]
        DCD     PWR_S3WU_IRQHandler         ; [ 77]
        DCD     SDMMC1_IRQHandler           ; [ 78]
        DCD     Reserved79_Handler          ; [ 79]
        DCD     GPDMA1_Channel8_IRQHandler  ; [ 80]
        DCD     GPDMA1_Channel9_IRQHandler  ; [ 81]
        DCD     GPDMA1_Channel10_IRQHandler ; [ 82]
        DCD     GPDMA1_Channel11_IRQHandler ; [ 83]
        DCD     GPDMA1_Channel12_IRQHandler ; [ 84]
        DCD     GPDMA1_Channel13_IRQHandler ; [ 85]
        DCD     GPDMA1_Channel14_IRQHandler ; [ 86]
        DCD     GPDMA1_Channel15_IRQHandler ; [ 87]
        DCD     I2C3_EV_IRQHandler          ; [ 88]
        DCD     I2C3_ER_IRQHandler          ; [ 89]
        DCD     SAI1_IRQHandler             ; [ 90]
        DCD     Reserved91_Handler          ; [ 91]
        DCD     TSC_IRQHandler              ; [ 92]
        DCD     AES_IRQHandler              ; [ 93]
        DCD     RNG_IRQHandler              ; [ 94]
        DCD     FPU_IRQHandler              ; [ 95]
        DCD     HASH_IRQHandler             ; [ 96]
        DCD     PKA_IRQHandler              ; [ 97]
        DCD     LPTIM3_IRQHandler           ; [ 98]
        DCD     SPI3_IRQHandler             ; [ 99]
        DCD     I2C4_ER_IRQHandler          ; [100]
        DCD     I2C4_EV_IRQHandler          ; [101]
        DCD     MDF1_FLT0_IRQHandler        ; [102]
        DCD     MDF1_FLT1_IRQHandler        ; [103]
        DCD     Reserved104_Handler         ; [104]
        DCD     Reserved105_Handler         ; [105]
        DCD     Reserved106_Handler         ; [106]
        DCD     ICACHE_IRQHandler           ; [107]
        DCD     OTFDEC1_IRQHandler          ; [108]
        DCD     Reserved109_Handler         ; [109]
        DCD     LPTIM4_IRQHandler           ; [110]
        DCD     DCACHE1_IRQHandler          ; [111]
        DCD     ADF1_IRQHandler             ; [112]
        DCD     ADC4_IRQHandler             ; [113]
        DCD     LPDMA1_Channel0_IRQHandler  ; [114]
        DCD     LPDMA1_Channel1_IRQHandler  ; [115]
        DCD     LPDMA1_Channel2_IRQHandler  ; [116]
        DCD     LPDMA1_Channel3_IRQHandler  ; [117]
        DCD     Reserved118_Handler         ; [118]
        DCD     DCMI_PSSI_IRQHandler        ; [119]
        DCD     Reserved120_Handler         ; [120]
        DCD     Reserved121_Handler         ; [121]
        DCD     Reserved122_Handler         ; [122]
        DCD     CORDIC_IRQHandler           ; [113]
        DCD     FMAC_IRQHandler             ; [114]
        DCD     LSECSSD_IRQHandler          ; [115]

__Vectors_End

__Vectors_Size  EQU   __Vectors_End - __Vectors


;******************************************************************************
; This is the code for exception handlers.
;
        AREA    |.text|, CODE, READONLY

;******************************************************************************
; This is the code that gets called when the processor first starts execution
; following a reset event.
;
Reset_Handler   PROC
        EXPORT  Reset_Handler   [WEAK]
        IMPORT  SystemInit
        IMPORT  __main
        IMPORT  assert_failed

