QuantumLeaps/3rd_party/nucleo-u545re/arm/startup_stm32u545retxq.s
        LDR     r0,=SystemInit  ; CMSIS system initialization
        BLX     r0

        ; Call the C library entry point that handles startup. This will copy
        ; the .data section initializers from flash to SRAM and zero fill the
        ; .bss section.
        ; NOTE: The __main function clears the C stack as well
        LDR     r0,=__main
        BX      r0

        ; __main calls the main() function, which should not return,
        ; but just in case jump to assert_failed() if main returns.
        CPSID   i                 ; disable all interrupts
        LDR     r0,=str_EXIT
        MOVS    r1,#1
        LDR     r2,=__initial_sp  ; re-set the SP in case of stack overflow
        MOV     sp,r2
        LDR     r2,=assert_failed
        BX      r2
str_EXIT
        DCB     "EXIT"
        ALIGN
        ENDP

;******************************************************************************
NMI_Handler     PROC
        EXPORT  NMI_Handler     [WEAK]
        CPSID   i                 ; disable all interrupts
        LDR     r0,=str_NMI
        MOVS    r1,#1
        LDR     r2,=__initial_sp  ; re-set the SP in case of stack overflow
        MOV     sp,r2
        LDR     r2,=assert_failed
        BX      r2
str_NMI
        DCB     "NMI"
        ALIGN
        ENDP

;******************************************************************************
HardFault_Handler PROC
        EXPORT  HardFault_Handler [WEAK]
        CPSID   i                 ; disable all interrupts
        LDR     r0,=str_HardFault
        MOVS    r1,#1
        LDR     r2,=__initial_sp  ; re-set the SP in case of stack overflow
        MOV     sp,r2
        LDR     r2,=assert_failed
        BX      r2
str_HardFault
        DCB     "HardFault"
        ALIGN
        ENDP

;******************************************************************************
MemManage_Handler PROC
        EXPORT  MemManage_Handler [WEAK]
        CPSID   i                 ; disable all interrupts
        LDR     r0,=str_MemManage
        MOVS    r1,#1
        LDR     r2,=__initial_sp  ; re-set the SP in case of stack overflow
        MOV     sp,r2
        LDR     r2,=assert_failed
        BX      r2
str_MemManage
        DCB     "MemManage"
        ALIGN
        ENDP

;******************************************************************************
BusFault_Handler PROC
        EXPORT  BusFault_Handler  [WEAK]
        CPSID   i                 ; disable all interrupts
        LDR     r0,=str_BusFault
        MOVS    r1,#1
        LDR     r2,=__initial_sp  ; re-set the SP in case of stack overflow
        MOV     sp,r2
        LDR     r2,=assert_failed
        BX      r2
str_BusFault
        DCB     "BusFault"
        ALIGN
        ENDP

;******************************************************************************
UsageFault_Handler PROC
        EXPORT  UsageFault_Handler [WEAK]
        CPSID   i                 ; disable all interrupts
        LDR     r0,=str_UsageFault
        MOVS    r1,#1
        LDR     r2,=__initial_sp  ; re-set the SP in case of stack overflow
        MOV     sp,r2
        LDR     r2,=assert_failed
        BX      r2
str_UsageFault
        DCB     "UsageFault"
        ALIGN
        ENDP

;******************************************************************************
SecureFault_Handler PROC
        EXPORT  SecureFault_Handler [WEAK]
        CPSID   i                 ; disable all interrupts
        LDR     r0,=str_UsageFault
        MOVS    r1,#1
        LDR     r2,=__initial_sp  ; re-set the SP in case of stack overflow
        MOV     sp,r2
        LDR     r2,=assert_failed
        BX      r2
str_SecureFault
        DCB     "SecureFault"
        ALIGN
        ENDP


;******************************************************************************
;
; Weak non-fault handlers...
;

;******************************************************************************
SVC_Handler PROC
        EXPORT  SVC_Handler       [WEAK]
        CPSID   i                 ; disable all interrupts
        LDR     r0,=str_SVC
        MOVS    r1,#1
        LDR     r2,=__initial_sp  ; re-set the SP in case of stack overflow
        MOV     sp,r2
        LDR     r2,=assert_failed
        BX      r2
str_SVC
        DCB     "SVC"
        ALIGN
        ENDP

;******************************************************************************
DebugMon_Handler PROC
        EXPORT  DebugMon_Handler  [WEAK]
        CPSID   i                 ; disable all interrupts
        LDR     r0,=str_DebugMon
        MOVS    r1,#1
        LDR     r2,=__initial_sp  ; re-set the SP in case of stack overflow
        MOV     sp,r2
        LDR     r2,=assert_failed
        BX      r2
str_DebugMon
        DCB     "DebugMon"
        ALIGN
        ENDP

;******************************************************************************
PendSV_Handler PROC
        EXPORT  PendSV_Handler    [WEAK]
        CPSID   i                 ; disable all interrupts
        LDR     r0,=str_PendSV
        MOVS    r1,#1
        LDR     r2,=__initial_sp  ; re-set the SP in case of stack overflow
        MOV     sp,r2
        LDR     r2,=assert_failed
        BX      r2
str_PendSV
        DCB     "PendSV"
        ALIGN
        ENDP

;******************************************************************************
SysTick_Handler PROC
        EXPORT  SysTick_Handler   [WEAK]
        CPSID   i                 ; disable all interrupts
        LDR     r0,=str_SysTick
        MOVS    r1,#1
        LDR     r2,=__initial_sp  ; re-set the SP in case of stack overflow
        MOV     sp,r2
        LDR     r2,=assert_failed
        BX      r2
str_SysTick
        DCB     "SysTick"
        ALIGN
        ENDP

;******************************************************************************
Default_Handler PROC
        EXPORT  WWDG_IRQHandler             [WEAK]
        EXPORT  PVD_PVM_IRQHandler          [WEAK]
        EXPORT  RTC_IRQHandler              [WEAK]
        EXPORT  RTC_S_IRQHandler            [WEAK]
        EXPORT  TAMP_IRQHandler             [WEAK]
        EXPORT  RAMCFG_IRQHandler           [WEAK]
        EXPORT  FLASH_IRQHandler            [WEAK]
        EXPORT  FLASH_S_IRQHandler          [WEAK]
        EXPORT  GTZC_IRQHandler             [WEAK]
        EXPORT  RCC_IRQHandler              [WEAK]
        EXPORT  RCC_S_IRQHandler            [WEAK]
        EXPORT  EXTI0_IRQHandler            [WEAK]
        EXPORT  EXTI1_IRQHandler            [WEAK]
        EXPORT  EXTI2_IRQHandler            [WEAK]
        EXPORT  EXTI3_IRQHandler            [WEAK]
        EXPORT  EXTI4_IRQHandler            [WEAK]
        EXPORT  EXTI5_IRQHandler            [WEAK]
        EXPORT  EXTI6_IRQHandler            [WEAK]
        EXPORT  EXTI7_IRQHandler            [WEAK]
        EXPORT  EXTI8_IRQHandler            [WEAK]
        EXPORT  EXTI9_IRQHandler            [WEAK]
        EXPORT  EXTI10_IRQHandler           [WEAK]
        EXPORT  EXTI11_IRQHandler           [WEAK]
        EXPORT  EXTI12_IRQHandler           [WEAK]
        EXPORT  EXTI13_IRQHandler           [WEAK]
        EXPORT  EXTI14_IRQHandler           [WEAK]
        EXPORT  EXTI15_IRQHandler           [WEAK]
        EXPORT  IWDG_IRQHandler             [WEAK]
        EXPORT  SAES_IRQHandler             [WEAK]
        EXPORT  GPDMA1_Channel0_IRQHandler  [WEAK]
        EXPORT  GPDMA1_Channel1_IRQHandler  [WEAK]
        EXPORT  GPDMA1_Channel2_IRQHandler  [WEAK]
        EXPORT  GPDMA1_Channel3_IRQHandler  [WEAK]
        EXPORT  GPDMA1_Channel4_IRQHandler  [WEAK]
        EXPORT  GPDMA1_Channel5_IRQHandler  [WEAK]
        EXPORT  GPDMA1_Channel6_IRQHandler  [WEAK]
        EXPORT  GPDMA1_Channel7_IRQHandler  [WEAK]
        EXPORT  ADC1_IRQHandler             [WEAK]
        EXPORT  DAC1_IRQHandler             [WEAK]
        EXPORT  FDCAN1_IT0_IRQHandler       [WEAK]
        EXPORT  FDCAN1_IT1_IRQHandler       [WEAK]
        EXPORT  TIM1_BRK_IRQHandler         [WEAK]
        EXPORT  TIM1_UP_IRQHandler          [WEAK]
        EXPORT  TIM1_TRG_COM_IRQHandler     [WEAK]
        EXPORT  TIM1_CC_IRQHandler          [WEAK]
        EXPORT  TIM2_IRQHandler             [WEAK]
        EXPORT  TIM3_IRQHandler             [WEAK]
        EXPORT  TIM4_IRQHandler             [WEAK]
        EXPORT  TIM5_IRQHandler             [WEAK]
        EXPORT  TIM6_IRQHandler             [WEAK]
        EXPORT  TIM7_IRQHandler             [WEAK]
        EXPORT  TIM8_BRK_IRQHandler         [WEAK]
        EXPORT  TIM8_UP_IRQHandler          [WEAK]
        EXPORT  TIM8_TRG_COM_IRQHandler     [WEAK]
        EXPORT  TIM8_CC_IRQHandler          [WEAK]
        EXPORT  I2C1_EV_IRQHandler          [WEAK]
        EXPORT  I2C1_ER_IRQHandler          [WEAK]
        EXPORT  I2C2_EV_IRQHandler          [WEAK]
        EXPORT  I2C2_ER_IRQHandler          [WEAK]
        EXPORT  SPI1_IRQHandler             [WEAK]
        EXPORT  SPI2_IRQHandler             [WEAK]
        EXPORT  USART1_IRQHandler           [WEAK]
        EXPORT  USART3_IRQHandler           [WEAK]
        EXPORT  UART4_IRQHandler            [WEAK]
        EXPORT  UART5_IRQHandler            [WEAK]
        EXPORT  LPUART1_IRQHandler          [WEAK]
        EXPORT  LPTIM1_IRQHandler           [WEAK]
        EXPORT  LPTIM2_IRQHandler           [WEAK]
        EXPORT  TIM15_IRQHandler            [WEAK]
        EXPORT  TIM16_IRQHandler            [WEAK]
        EXPORT  TIM17_IRQHandler            [WEAK]
        EXPORT  COMP_IRQHandler             [WEAK]
        EXPORT  USB_IRQHandler              [WEAK]
        EXPORT  CRS_IRQHandler              [WEAK]
        EXPORT  OCTOSPI1_IRQHandler         [WEAK]
        EXPORT  PWR_S3WU_IRQHandler         [WEAK]
        EXPORT  SDMMC1_IRQHandler           [WEAK]
        EXPORT  GPDMA1_Channel8_IRQHandler  [WEAK]
        EXPORT  GPDMA1_Channel9_IRQHandler  [WEAK]
        EXPORT  GPDMA1_Channel10_IRQHandler [WEAK]
        EXPORT  GPDMA1_Channel11_IRQHandler [WEAK]
        EXPORT  GPDMA1_Channel12_IRQHandler [WEAK]
        EXPORT  GPDMA1_Channel13_IRQHandler [WEAK]
        EXPORT  GPDMA1_Channel14_IRQHandler [WEAK]
        EXPORT  GPDMA1_Channel15_IRQHandler [WEAK]
        EXPORT  I2C3_EV_IRQHandler          [WEAK]
        EXPORT  I2C3_ER_IRQHandler          [WEAK]
        EXPORT  SAI1_IRQHandler             [WEAK]
        EXPORT  TSC_IRQHandler              [WEAK]
        EXPORT  AES_IRQHandler              [WEAK]
        EXPORT  RNG_IRQHandler              [WEAK]
        EXPORT  FPU_IRQHandler              [WEAK]
        EXPORT  HASH_IRQHandler             [WEAK]
        EXPORT  PKA_IRQHandler              [WEAK]
        EXPORT  LPTIM3_IRQHandler           [WEAK]
        EXPORT  SPI3_IRQHandler             [WEAK]
        EXPORT  I2C4_ER_IRQHandler          [WEAK]
        EXPORT  I2C4_EV_IRQHandler          [WEAK]
        EXPORT  MDF1_FLT0_IRQHandler        [WEAK]
        EXPORT  MDF1_FLT1_IRQHandler        [WEAK]
        EXPORT  ICACHE_IRQHandler           [WEAK]
        EXPORT  OTFDEC1_IRQHandler          [WEAK]
        EXPORT  LPTIM4_IRQHandler           [WEAK]
        EXPORT  DCACHE1_IRQHandler          [WEAK]
        EXPORT  ADF1_IRQHandler             [WEAK]
        EXPORT  ADC4_IRQHandler             [WEAK]
        EXPORT  LPDMA1_Channel0_IRQHandler  [WEAK]
        EXPORT  LPDMA1_Channel1_IRQHandler  [WEAK]
        EXPORT  LPDMA1_Channel2_IRQHandler  [WEAK]
        EXPORT  LPDMA1_Channel3_IRQHandler  [WEAK]
        EXPORT  DCMI_PSSI_IRQHandler        [WEAK]
        EXPORT  CORDIC_IRQHandler           [WEAK]
        EXPORT  FMAC_IRQHandler             [WEAK]
        EXPORT  LSECSSD_IRQHandler          [WEAK]
        EXPORT  Reserved62_Handler          [WEAK]
        EXPORT  Reserved75_Handler          [WEAK]
        EXPORT  Reserved79_Handler          [WEAK]
        EXPORT  Reserved91_Handler          [WEAK]
        EXPORT  Reserved104_Handler         [WEAK]
        EXPORT  Reserved105_Handler         [WEAK]
        EXPORT  Reserved106_Handler         [WEAK]
        EXPORT  Reserved109_Handler         [WEAK]
        EXPORT  Reserved118_Handler         [WEAK]
        EXPORT  Reserved120_Handler         [WEAK]
        EXPORT  Reserved121_Handler         [WEAK]
        EXPORT  Reserved122_Handler         [WEAK]


WWDG_IRQHandler
PVD_PVM_IRQHandler
RTC_IRQHandler
RTC_S_IRQHandler
TAMP_IRQHandler
RAMCFG_IRQHandler
FLASH_IRQHandler
FLASH_S_IRQHandler
GTZC_IRQHandler
RCC_IRQHandler
RCC_S_IRQHandler
EXTI0_IRQHandler
EXTI1_IRQHandler
EXTI2_IRQHandler
EXTI3_IRQHandler
EXTI4_IRQHandler
EXTI5_IRQHandler
EXTI6_IRQHandler
EXTI7_IRQHandler
EXTI8_IRQHandler
EXTI9_IRQHandler
EXTI10_IRQHandler
EXTI11_IRQHandler
EXTI12_IRQHandler
EXTI13_IRQHandler
EXTI14_IRQHandler
EXTI15_IRQHandler
IWDG_IRQHandler
SAES_IRQHandler
GPDMA1_Channel0_IRQHandler
GPDMA1_Channel1_IRQHandler
GPDMA1_Channel2_IRQHandler
GPDMA1_Channel3_IRQHandler
GPDMA1_Channel4_IRQHandler
GPDMA1_Channel5_IRQHandler
GPDMA1_Channel6_IRQHandler
GPDMA1_Channel7_IRQHandler
ADC1_IRQHandler
DAC1_IRQHandler
FDCAN1_IT0_IRQHandler
FDCAN1_IT1_IRQHandler
TIM1_BRK_IRQHandler
TIM1_UP_IRQHandler
TIM1_TRG_COM_IRQHandler
TIM1_CC_IRQHandler
TIM2_IRQHandler
TIM3_IRQHandler
TIM4_IRQHandler
TIM5_IRQHandler
TIM6_IRQHandler
TIM7_IRQHandler
TIM8_BRK_IRQHandler
TIM8_UP_IRQHandler
TIM8_TRG_COM_IRQHandler
TIM8_CC_IRQHandler
I2C1_EV_IRQHandler
I2C1_ER_IRQHandler
I2C2_EV_IRQHandler
I2C2_ER_IRQHandler
SPI1_IRQHandler
SPI2_IRQHandler
USART1_IRQHandler
USART3_IRQHandler
UART4_IRQHandler
UART5_IRQHandler
LPUART1_IRQHandler
LPTIM1_IRQHandler
LPTIM2_IRQHandler
TIM15_IRQHandler
TIM16_IRQHandler
TIM17_IRQHandler
COMP_IRQHandler
USB_IRQHandler
CRS_IRQHandler
OCTOSPI1_IRQHandler
PWR_S3WU_IRQHandler
SDMMC1_IRQHandler
GPDMA1_Channel8_IRQHandler
GPDMA1_Channel9_IRQHandler
GPDMA1_Channel10_IRQHandler
GPDMA1_Channel11_IRQHandler
GPDMA1_Channel12_IRQHandler
GPDMA1_Channel13_IRQHandler
GPDMA1_Channel14_IRQHandler
GPDMA1_Channel15_IRQHandler
I2C3_EV_IRQHandler
I2C3_ER_IRQHandler
SAI1_IRQHandler
TSC_IRQHandler
AES_IRQHandler
RNG_IRQHandler
FPU_IRQHandler
HASH_IRQHandler
PKA_IRQHandler
LPTIM3_IRQHandler
SPI3_IRQHandler
I2C4_ER_IRQHandler
I2C4_EV_IRQHandler
MDF1_FLT0_IRQHandler
MDF1_FLT1_IRQHandler
ICACHE_IRQHandler
OTFDEC1_IRQHandler
LPTIM4_IRQHandler
DCACHE1_IRQHandler
ADF1_IRQHandler
ADC4_IRQHandler
LPDMA1_Channel0_IRQHandler
LPDMA1_Channel1_IRQHandler
LPDMA1_Channel2_IRQHandler
LPDMA1_Channel3_IRQHandler
DCMI_PSSI_IRQHandler
CORDIC_IRQHandler
FMAC_IRQHandler
LSECSSD_IRQHandler
Reserved62_Handler            ; [ 62]
Reserved75_Handler            ; [ 75]
Reserved79_Handler            ; [ 79]
Reserved91_Handler            ; [ 91]
Reserved104_Handler           ; [104]
Reserved105_Handler           ; [105]
Reserved106_Handler           ; [106]
Reserved109_Handler           ; [109]
Reserved118_Handler           ; [118]
Reserved120_Handler           ; [120]
Reserved121_Handler           ; [121]
Reserved122_Handler           ; [122]
        CPSID   i                 ; disable all interrupts
        LDR     r0,=str_Undefined
        MOVS    r1,#1
        LDR     r2,=__initial_sp  ; re-set the SP in case of stack overflow
        MOV     sp,r2
        LDR     r2,=assert_failed
        BX      r2
str_Undefined
        DCB     "Undefined"
        ALIGN
        ENDP

        ALIGN               ; make sure the end of this section is aligned

;******************************************************************************
; The function expected of the C library startup code for defining the stack
; and heap memory locations.  For the C library version of the startup code,
; provide this function so that the C library initialization code can find out
; the location of the stack and heap.
;
    IF :DEF: __MICROLIB
        EXPORT  __initial_sp
        EXPORT  __stack_limit
        EXPORT  __heap_base
        EXPORT  __heap_limit
    ELSE
        IMPORT  __use_two_region_memory
        EXPORT  __user_initial_stackheap

__user_initial_stackheap PROC
        LDR     R0, =__heap_base
        LDR     R1, =__stack_limit
        LDR     R2, =__heap_limit
        LDR     R3, =__stack_base
        BX      LR
        ENDP
    ENDIF
        ALIGN               ; make sure the end of this section is aligned

    END                     ; end of module

